In [3]:
import pandas as pd
y= pd.Period("2016")
y

Period('2016', 'A-DEC')

In [5]:
y.start_time

Timestamp('2016-01-01 00:00:00')

In [6]:
y.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [10]:
m=pd.Period('2016-12',freq='M')

In [12]:
m.start_time
m.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [13]:
m+1

Period('2017-01', 'M')

In [14]:
d=pd.Period('2016-02-28',freq='D')

In [15]:
d+1

Period('2016-02-29', 'D')

In [17]:
h=pd.Period('2016-02-28 23:00:00',freq='H')

In [19]:
h.start_time

Timestamp('2016-02-28 23:00:00')

In [20]:
h.end_time

Timestamp('2016-02-28 23:59:59.999999999')

In [21]:
h+1

Period('2016-02-29 00:00', 'H')

In [22]:
h+pd.offsets.Hour(5)

Period('2016-02-29 04:00', 'H')

In [23]:
h-6

Period('2016-02-28 17:00', 'H')

In [27]:
q=pd.Period('2017Q1',freq='Q-JAN')        

q

#month is ending in january

Period('2017Q1', 'Q-JAN')

In [25]:
q.start_time

Timestamp('2016-02-01 00:00:00')

In [28]:
q.asfreq('M',how='start')

Period('2016-02', 'M')

In [29]:
q.asfreq('M',how='end')

Period('2016-04', 'M')

In [30]:
q2=pd.Period('2018Q1',freq='Q-JAN')

In [31]:
q2-q

In [39]:
idx=pd.period_range('2011','2017',freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4', '2016Q1',
             '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2', '2017Q3',
             '2017Q4'],
            dtype='period[Q-JAN]')

In [41]:
idx[0].start_time

Timestamp('2010-11-01 00:00:00')

In [42]:
idx[0].end_time

Timestamp('2011-01-31 23:59:59.999999999')

In [45]:
idx=pd.period_range('2011',periods=10,freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1'],
            dtype='period[Q-JAN]')

In [48]:
import numpy as np
ps=pd.Series(np.random.randn(len(idx)),idx)
ps

2011Q4   -0.181034
2012Q1    1.313132
2012Q2   -0.100240
2012Q3    0.070458
2012Q4    0.526343
2013Q1    1.017311
2013Q2    0.164119
2013Q3    1.230775
2013Q4   -0.187410
2014Q1    0.006807
Freq: Q-JAN, dtype: float64

In [49]:
ps.index

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1'],
            dtype='period[Q-JAN]')

In [50]:
ps['2011':'2016']

2011Q4   -0.181034
2012Q1    1.313132
2012Q2   -0.100240
2012Q3    0.070458
2012Q4    0.526343
2013Q1    1.017311
2013Q2    0.164119
2013Q3    1.230775
2013Q4   -0.187410
2014Q1    0.006807
Freq: Q-JAN, dtype: float64

In [51]:
pst=ps.to_timestamp()
pst       
#datetime index..

2010-11-01   -0.181034
2011-02-01    1.313132
2011-05-01   -0.100240
2011-08-01    0.070458
2011-11-01    0.526343
2012-02-01    1.017311
2012-05-01    0.164119
2012-08-01    1.230775
2012-11-01   -0.187410
2013-02-01    0.006807
Freq: QS-NOV, dtype: float64

In [52]:
pst.index

DatetimeIndex(['2010-11-01', '2011-02-01', '2011-05-01', '2011-08-01',
               '2011-11-01', '2012-02-01', '2012-05-01', '2012-08-01',
               '2012-11-01', '2013-02-01'],
              dtype='datetime64[ns]', freq='QS-NOV')

In [53]:
pst.to_period()
#periodindex

2010Q4   -0.181034
2011Q1    1.313132
2011Q2   -0.100240
2011Q3    0.070458
2011Q4    0.526343
2012Q1    1.017311
2012Q2    0.164119
2012Q3    1.230775
2012Q4   -0.187410
2013Q1    0.006807
Freq: Q-DEC, dtype: float64

In [78]:
import pandas as pd
df=pd.read_csv('F:\\py\\pandas\\timeseires2 periodandperiodindex\\wea.csv')

In [56]:
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [79]:
df.set_index("Line Item",inplace=True)
df = df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [68]:
df = df.T
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [87]:
df.index = pd.PeriodIndex(df.index, freq="Q-JAN")
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [88]:
df["Start Date"]=df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit Start Date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [89]:
df["End Date"]=df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit Start Date                      End Date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999